app/controllers/users_controller.rb

  def index
    @users = User.all
    @users = User.paginate(:page => params[:page], :per_page => 5)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"