app/views/users/registrations/new.html.erb

SELECT "cities".* FROM "cities"
---
        <%= f.label :city %><br />
        <%= f.collection_select(:city_id, City.all, :id, :name ) %>